{"en/about-me":{"title":"About me","links":[],"tags":[],"content":""},"en/index":{"title":"index","links":["en/about-me"],"tags":[],"content":"Author\nAs usually seen on blogs, there must be a about-me page."},"en/posts/insights/index":{"title":"Insights","links":[],"tags":[],"content":""},"en/posts/insights/post-1":{"title":"Improving Templater  templates over time","links":[],"tags":["obsidian","IT/program/quartz","productivity","automation"],"content":"Just a place where I want to store all of tips used to make this page a bit easier to manage\nShared prompt value\nIt is possible to ask once for a prompt in a Templater plugin:\n&lt;%*\n\nlet title = await tp.system.prompt(&quot;Podaj tytuł&quot;)\n\n-%&gt;\n---\ntitle: &lt;% title %&gt;\n// ..\naliases:\n  - &lt;% title %&gt;\n\nSource"},"en/posts/personal/index":{"title":"Personal","links":[],"tags":[],"content":""},"index":{"title":"main page","links":["en/","pl/","en/posts/insights/","pl/posts/insights/"],"tags":[],"content":"Hi there!\nThis site is bilingual, so choose wisely:\nEnglish\nPolski\nShortcuts\nThose pages will be updated rather frequently, so I bring those higher:\nInsights - tech/personal short notes about different things. Personal, tech, you name it.\nSkróty\nIt’s translated version of paragraph above.\nTe strony będę aktualizował znacznie częściej, więc promuję te wrzucając to wyżej.\nInsajty"},"pl/about-me":{"title":"O mnie","links":[],"tags":[],"content":""},"pl/garden/books/Narkotyki-bez-paniki":{"title":"Narkotyki bez paniki","links":["David-Nutt","pl/posts/insights/2024-06-13-udar-a-alkohol"],"tags":["Typ/Recenzja","Książka","Psychodeliki","Narkotyki","Odwaga","SzerszeSpojrzenie"],"content":"Bardzo fajna, naukowa książka o substancjach psychoaktywnych, w większości dość mocno osadzona w badaniach i naukowym świecie, co moje serduszko wyjątkowo docenia.\nPewną rzeczą którą chciałbym docenić i naznaczyć tą książkę to odwaga w głoszeniu swojego zdania. David Nutt, autor na skutek swoich opinii był zmuszony do zrezygnowania ze stanowniska. Czuję respekt wobec tego poziomu ufania własnemu zdaniu i intuicji.\nJak też wspomniałem we wpisie, doceniam książkę przez szersze spojrzenie.\nLinki\nWywiad z autorem"},"pl/garden/books/index":{"title":"Książki","links":[],"tags":[],"content":"Książki które albo przeczytałem1\nFootnotes\n\n\nAlbo wciąż próbuję ↩\n\n\n"},"pl/garden/index":{"title":"Cyfrowy ogród","links":[],"tags":[],"content":"Czyli miejsce dlaczego to obsidian, a nie typowy blog - w tym miejscu będą wszystkie nielinearne, łączące się wpisy, oceny, fakty i inne."},"pl/garden/maps/Mapa-o-Olsztynie":{"title":"Mapa o Olsztynie","links":["tags/newsletter","tags/automatyzacja"],"tags":["Typ/Mapa","Olsztyn","newsletter","automatyzacja"],"content":"Newslettery\n\nBardzo fajnym przykładem lokalnegonewsletter jest Olsztyn. W skrócie.1. Z tego co pamiętam jest w dużym stopniu oparty naautomatyzacja, w tym takie rzeczy jak make.com, bodajże.\n\nFootnotes\n\n\nPolecam przejrzeć w szczególności przykłady ostatnich prasówek, dostępnych pod tym linkiem. ↩\n\n\n"},"pl/garden/maps/Mapa-o-traumie":{"title":"Mapa o traumie","links":["pl/garden/podcasts/K3,-odc.-207---wzrost-potraumatyczny"],"tags":["Typ/Mapa"],"content":"Podcasty\n\nW kontekście tego co dalej ciekawe spojrzenie dostarcza K3, odc. 207 - wzrost potraumatyczny.\n"},"pl/garden/maps/index":{"title":"Dział kartograficzny, czyli lista map","links":[],"tags":[],"content":"Moje osobiste podejście rzeczy ważnych dla mnie, istotnych, takich którymi chcę się dzielić i móc je łączyć w niespodziewane sposoby."},"pl/garden/podcasts/K3,-odc.-207---wzrost-potraumatyczny":{"title":"K3, odc. 207 - wzrost potraumatyczny","links":["Wzrost-potraumatyczny"],"tags":["Typ/Odnośnik","Trauma","PTSD","Podcast"],"content":"Dość ciekawa rozmowa o tym, co trauma daje, czyli tzw. Wzrost potraumatyczny.\nLink."},"pl/index":{"title":"Strona główna","links":["pl/about-me","pl/posts/insights/","pl/projects/"],"tags":[],"content":"Hej!\nAutor\nCzyli jak na każdego bloga przystało - strona O mnie\nPosty\nW ramach tego że noszę różne czapki kapelusze1,  mam podział sekcji na dwa typy:\n\ntzw. insighty, gdzie to będzie więcej niż na threadsach, mniej niż na medium - ot, krótkie, merytoryczne posty2. Dostępne będą tutaj: Insighty\n\nProjekty, certyfikaty, inne\nLista projektów które stworzyłem, brałem udział lub artystycznie pasują mi do tej sekcji będę umieszczał w tym miejscu: Lista projektów\nFootnotes\n\n\nwearing diffrent hats brzmi źle w tej wersji ↩\n\n\na czasem shitposting ↩\n\n\n"},"pl/posts/index":{"title":"Posty","links":["pl/"],"tags":[],"content":"Opis o co dokładnie chodzi z kategoriami znajduje się na Strona główna."},"pl/posts/insights/2024-06-13-dpd-a-przesylki":{"title":"DPD a przesyłki - jak poprawić jakość niskim kosztem?","links":[],"tags":["Typ/Insight","Protipy","kurierzy","DPD"],"content":"Nie, żebym samemu miał bardzo nieprzyjemne doświadczenie ze składaniem reklamacji w DPD, dlatego ten protip przeklejam z przyjemnością:\n\nTen magiczny “podpis”, widoczny jako odbiorca w statusie to przepisanie nazwiska z listu na zebrze przy zatwierdzaniu. Fizycznych podpisów kurierzy nie zbierają od czasów covida. Jeśli mirek chciał do rąk odbiorcy, mógł dopłacić DPD za usługę DRW1 z pinem, wtedy kurier nie wrzuci takiej paczki za płot, bo będzie musiał wpisać pin od odbiorcy, żeby dobić ją w systemie. Ot cała magia.\n\nŹródło.\nFootnotes\n\n\nDo Rąk Własnych ↩\n\n\n"},"pl/posts/insights/2024-06-13-udar-a-alkohol":{"title":"Udar a alkohol","links":["pl/projects/mgr","pl/garden/books/Narkotyki-bez-paniki"],"tags":["alkohol","udar","Typ/Insight"],"content":"Przechodząc przez literaturę do pracy magisterskiej znalazłem jedną, nieoczywistą ciekawostkę: otóż małe1 spożycie alkoholu zmniejsza prawdopodobieństwo udaru krwotocznego. Na krwotoczny nie robi różnicy - natomiast picie dużo bądź w ciągach już te prawdopodobieństwo dość mocno zwiększa.\n\nLight and moderate alcohol consumption was associated with a lower risk of ischemic stroke, whereas high and heavy drinking was associated with an increased risk;\n\nŹródło.\nOczywiście, to nie wyraża mojej opinii wobec alkoholu - tutaj bliżej mi do perspektywy Davida Nutta, autora m.in. Narkotyki bez paniki która określa alkohol mianem najbardziej szkodliwej używki2 - w analizie która nie patrzy tylko na koszty osobowo/zdrowotne, ale patrzy szerzej, uwzględniając też koszty społeczne danej związane z daną substancją.\nFootnotes\n\n\nDo 12 gram alkoholu etylowego. ↩\n\n\nNiestety premiera nowej książki wyparła z SEO googla stare artykuły na ten temat ↩\n\n\n"},"pl/posts/insights/2024-06-13-witaj-swiecie":{"title":"Witaj, świecie","links":["pl/projects/entuzjazm","tags/IT/WebFramework/astro","tags/IT/program/quartz"],"tags":["Typ/Insight","IT/WebFramework/astro","IT/program/quartz"],"content":"Kolejne podejście do blogowania. Moje wcześniejsze podejście do blogowania to było tak naprawdę próba podejścia pod zrobienie entuzjazm1 przeimplementowania obsidiana wastro, stąd zobaczymy jak mi pójdzie wquartz\nFootnotes\n\n\nNazwa dość implikująca moje podejście XD ↩\n\n\n"},"pl/posts/insights/2024-07-03-czy-ai-zastapi-programistow":{"title":"Czy AI zastąpi programistów","links":["tags/IT/godot","Tunnelify","tags/claude"],"tags":["Typ/Insight","IT/godot","claude","AI"],"content":"Na skutek jednego projektu stwierdziłem, że chcę podłubać sobie wgodot  przy innym pobocznym projekcie, a że żyjemy w XXI wieku - niech to będzie dłubanie wspomagane sztuczną inteligencją, a dokładnie -claude 1.\nWygenerujmy sobie kod obsługi klikania myszki:\n\nJest ładnie, jest match, wygląda elegancko… Z tym tylko że nie działa: po dłuższym debugowaniu wyszło, że żadnej z opcji nie jest łapana2.\nDziała natomiast rzemieślnicze, wyklikane przez człowieka is:\n\nZapytacie dlaczego? Myślę że to kwestia alternatywnego do pewnego stopnia języka, z którymi LLMy jeszcze miały za mało styczności.\nWracając natomiast do odpowiedzi z początku - na chwilę obecną jeszcze nie, ale przy dość dużym debugowaniu i uważności mogą być ciekawym wsparciem.\nFootnotes\n\n\nOdpowiada mi najbardziej - czy to charakter odpowiedzi, ich styl i podatność na sugestie. ↩\n\n\nWszystko ląduje w domyślnej gałęzi &quot;_&quot;: ↩\n\n\n"},"pl/posts/insights/index":{"title":"Insighty","links":[],"tags":[],"content":""},"pl/posts/personal/index":{"title":"Posty osobiste","links":[],"tags":[],"content":""},"pl/projects/entuzjazm":{"title":"Entuzjazm","links":[],"tags":["IT/ProgrammingLanguage/html","IT/ProgrammingLanguage/css","IT/WebFramework/tailwindcss","github","IT/WebFramework/astro","IT/program/quartz","Typ/Projekt"],"content":""},"pl/projects/index":{"title":"Lista projektów","links":[],"tags":[],"content":"Lista projektów które stworzyłem, brałem udział lub artystycznie pasują mi do tej sekcji będę umieszczał w tym miejscu."},"pl/projects/mgr":{"title":"Praca magisterska","links":[],"tags":["stroke","udar","Typ/Projekt"],"content":"Moja przyszła, potencjalna praca magisterska."},"pl/projects/sajna":{"title":"sajna","links":[],"tags":["IT/LoRa","IT/ProgrammingLanguage/Csharp","IT/STM32","IT/ProtocolBuffer","Typ/Projekt"],"content":"Moja praca inżynierska."},"tags/IT/godot":{"title":"godot","links":[],"tags":[],"content":"hi"}}